Repository: xgxdmx/Kratos_Xiaoyou
Catalog: inc/enlighter/lang/enlighter-*.po
Languages: fr_fr, pt_br

source: QuickTags are used to simplify the editing process when working in text/html mode. A bunch of QuickTags (all registered languages) can be added to the Text/HTML Editor Toolbar.
fr_fr: Les QuickTags sont utilisés pour simplifier le processus d’édition en mode text/html. Les QuickTags (toutes les langues enregistrées) peuvent être ajoutés à la barre d'outils de l'éditeur texte/HTML.

source: Enable Backend Integration
fr_fr: Intégration à l’éditeur dans le Back-Office

source: Do you want to use the QuickTags extensions in your frontend (website)?
fr_fr: Voulez-vous utiliser les extensions QuickTags dans votre interface Front-Office (site Web) ?

source: Enable Frontend Integration
fr_fr: Intégration à l’éditeur dans le Front-Office

source: HTML Tags are fully compatible with the Visual Editor Mode.
fr_fr: Les balises HTML sont entières compatibles avec l'éditeur visuel.

source: QuickTag Mode
fr_fr: Mode QuickTag

source: Print HTML Tags (default)
fr_fr: Affiche les balises HTML (défaut)

source: Print Shortcode Tags
fr_fr: Affiches les codes courts

source: Disable QuickTags
fr_fr: Désactive les codes courts

source: Leave fields blank to force basic theme styles
fr_fr: Laissez les champs vides pour forcer les styles du thème de base
pt_br: Deixe os campos em branco para forçar os estilos de tema básicos

source: Open Live Preview
fr_fr: Ouvrir l'aperçu en direct

source: Theme Base
fr_fr: Thème de base

source: Basic Theme (will be extended)
fr_fr: Thème de base (sera étendu)
pt_br: Tema Básico (será extendido)

source: Load Theme styles
fr_fr: Charge les styles du thèmes
pt_br: Carregar estilos do tema

source: Font Styles
fr_fr: Styles d’écriture
pt_br: Estilos de Fonte

source: Font-Family
fr_fr: Police
pt_br: Família da Fonte

source: e.g. Monaco, Courier, Monospace
fr_fr: ex Monaco, Courier, Monospace
pt_br: ex Monaco, Courier, Monospace

source: Font-Size
fr_fr: Taille d’écriture
pt_br: Tamanho da Fonte

source: e.g. 12px, 1.2em, 11pt
fr_fr: ex 12px, 1.2em, 11pt
pt_br: ex 12px, 1.2em, 11pt

source: Line height
fr_fr: Hauteur de ligne
pt_br: Tamanho da linha

source: e.g. 16px, 1.5em
fr_fr: ex. 16px, 1.5em
pt_br: ex 16px, 1.5em

source: Font-Color
fr_fr: Couleur d’écriture
pt_br: Cor da Fonte

source: e.g. #000000, #ff00c1
fr_fr: ex #000000, #ff00c1
pt_br: ex #000000, #ff00c1

source: Line Number Styles
fr_fr: Styles des numéro de ligne
pt_br: Estilos de Números das Linhas

source: e.g. 10px, 1.2em, 11pt
fr_fr: ex 10px, 1.2em, 11pt
pt_br: ex 10px, 1.2em, 11pt

source: RAW Font Styles
fr_fr: Styles de polices RAW
pt_br: Estilos de Fonte Originais

source: Background-Color
fr_fr: Couleur de fond
pt_br: Cor de Fundo

source: e.g. #ffffff
fr_fr: ex. #ffffff
pt_br: ex #ffffff

source: Special Styles
fr_fr: Styles spéciaux
pt_br: Estilos Especiais

source: Line highlighting Color
fr_fr: Couleur de la ligne surlignée
pt_br: Cor de destaque da linha

source: Line hover Color
fr_fr: Couleur de la ligne survolé
pt_br: Cor da linha ao passar o mouse

source: e.g. #f0f0ff
fr_fr: ex. #f0f0ff
pt_br: ex #f0f0ff

source: Token Styles
fr_fr: Styles des jetons
pt_br: Estilos dos Tokens

source: Keyword(Type1)
fr_fr: Mot clef (Type1)
pt_br: Palavra-chave (Tipo 1)

source: Keyword(Type2)
fr_fr: Mot clef (Type2)
pt_br: Palavra-chave (Tipo 2)

source: Keyword(Type3)
fr_fr: Mot clef (Type3)
pt_br: Palavra-chave (Tipo 3)

source: Keyword(Type4)
fr_fr: Mot clef (Type4)
pt_br: Palavra-chave (Tipo 4)

source: Strings(Type1)
fr_fr: Chaîne de caractères (Type1)
pt_br: Strings (Tipo 1)

source: Strings(Type2)
fr_fr: Chaîne de caractères (Type2)
pt_br: Strings (Tipo 2)

source: Strings(Type3)
fr_fr: Chaîne de caractères (Type3)
pt_br: Strings (Tipo 3)

source: Number
fr_fr: Nombre
pt_br: Número

source: Method(Type1)
fr_fr: Méthode (Type1)
pt_br: Método (Tipo 1)

source: Method(Type2)
fr_fr: Méthode (Type2)
pt_br: Método (Tipo 2)

source: Bracket
fr_fr: Parenthèse
pt_br: Bracket (colchete/parênteses)

source: Symbol
fr_fr: Symbole
pt_br: Símbolo

source: EscapeSymbol
fr_fr: Symbole d'échappement
pt_br: Símbolo de Escape

source: No Decoration
fr_fr: Pas de décoration
pt_br: Sem Decoração

source: Underline
fr_fr: Souligné
pt_br: Sublinhado

source: Overline
fr_fr: Surligné
pt_br: Linha em cima

source: Line through
fr_fr: Barré
pt_br: Riscado

source: Normal Style
fr_fr: Normal
pt_br: Estilo Normal

source: Bold Style
fr_fr: Gras
pt_br: Negrito

source: Italic Style
fr_fr: Italic
pt_br: Itálico

source: Bold+Italic Style
fr_fr: Gras + Italic
pt_br: Negrito + Itálico

source: Text:
fr_fr: Texte :
pt_br: Texto:

source: Background:
fr_fr: Fond :
pt_br: Fundo:

source: Gutenberg Editor
fr_fr: Éditeur Gutenberg

source: Gutenberg Editor Plugin
fr_fr: Extension de l’éditeur Gutenberg

source: To use EnlighterJS within Gutenberg you can enable this feature. It loads the EnlighterJS Gutenberg.Plugin.
fr_fr: Pour utiliser EnlighterJS dans Gutenberg, il faut activer cette fonctionnalité. Ceci chargera l’extension EnlighterJS dans Gutenberg.

source: Warning: Please keep in mind that this version of Enlighter Plugin.Gutenberg is still BETA software and may have some serious bugs!
fr_fr: Attention : cette version de l’extension Enlighter pour Gutenberg est toujours en version BETA et peut contenir de sérieux bugs!

source: Enable
fr_fr: Activé

source: Classic Editor (TinyMCE 4)
fr_fr: Éditeur standard (TinyMCE 4)

source: Visual Editor Integration
fr_fr: Intégration à l’éditeur avancée

source: Enlighter provides a full Visual Editor integration. You can turn it off if you only want to use shortcodes.
fr_fr: Enlighter fournit une intégration complète de l’éditeur avancée. Vous pouvez le désactiver si vous souhaitez uniquement utiliser des codes courts.

source: Do you want to use the Visual Editor extensions in your frontend (website) ? May required for frontend editing plugins.
fr_fr: Utiliser les extensions de l’éditeur graphique dans votre interface ? Il peut-être requis pour les plugins d’édition frontale.

source: WordPress Limits the Editor-Width to ~600px. You can disable this limit - might be useful for posting source-code!
fr_fr: Par défaut, WordPress limite la largeur de l’éditeur à ~600px. Vous pouvez désactiver cette limite. Cela pourrait être utile pour poster du code source !

source: Automatic Width (max)
fr_fr: Largeur automatique (max)

source: In addition to the code-insert button, Enlighter can add a set formats to the editor.
fr_fr: En plus du bouton d’insertion de code, Enlighter peut ajouter un ensemble de formats à l’éditeur.

source: Add Editor Formats
fr_fr: Ajouter les formats à l’éditeur

source: The default keyboard shortcut (shift+alt+x) action can be modified to convert the current selection into an Enlighter codeblock.
fr_fr: Le raccourci clavier par défaut (Maj + Alt + x) peut être modifiée pour convertir la sélection actuelle en un bloc de code Enlighter.

source: Enable Keyboard Shortcut
fr_fr: Activer les raccourcis clavier

source: By default, the <kbd>tab</kbd> button does not add indentation to the content. Enlighter comes with its own editing plugin which allows you to use tabs within the Editor to align code.
fr_fr: Par défaut, la touche <kbd>tab</ kbd> n’ajoute pas d’indentation au contenu. Enlighter est livré avec son propre plug-in d’édition qui vous permet d’utiliser des fabulations dans l’éditeur pour aligner le code.

source: This option disables the <strong>tabfocus plugin</strong> and requires that the Enlighter <code>indent</code> option has been set to spaces!
fr_fr: Cette option désactive l’<strong>extension tabfocus</strong> et requiert que l’option <code>d’indentation</code> de Enlighter a été paramétrée avec des espaces !

source: Enable Tab Indentation
fr_fr: Activé l’indentation avec tabulations

source: Code-Block Styles
fr_fr: Styles de bloc de code

source: It is also possible to influence the code-block styles of the Visual-Editor. Maybe you like another background color or font-family.
fr_fr: Il est possible de modifier les styles de bloc de code dans l’éditeur graphique. Avec une autre couleur de fond ou une famille de police.

source: e.g. "Source Code Pro", "Liberation Mono", "Courier New", Courier, monospace
fr_fr: ex « Source Code Pro », « Liberation Mono », « Courier New », Courier, monospace

source: e.g. 0.7em
fr_fr: ex 0.7em

source: e.g. 1.4em
fr_fr: ex 1.4em

source: e.g. #565b60
fr_fr: ex #565b60

source: e.g. #f7f7f7
fr_fr: ex #f7f7f7

source: Restore defaults
fr_fr: Restaurer les valeurs d’origines

source: Webfonts Loader
fr_fr: Chargement des polices Web

source: Some Enlighter Themes uses modern fonts which may not available for your users by default.
fr_fr: Certains thèmes d’Enlighter utilisent des polices modernes qui peuvent ne pas être disponibles par défaut pour vos utilisateurs.

source: To provide the best visual experience, it`s possible to load the missing fonts automatically using <a href="https://www.google.com/fonts">Google Webfonts</a>.
fr_fr: Pour offrir la meilleure expérience visuelle possible, il est possible de charger automatiquement les polices manquantes à l’aide de <a href="https://www.google.com/fonts">Google Webfonts</a>.

source: The following fonts are used by Enlighter`s build-in themes:
fr_fr: Les polices suivantes sont utilisées par les thèmes intégrés d’Enlighter :

source: Monospace Webfonts
fr_fr: Police de type Monospace (chasse fixe)

source: Only regular, italic, bold, bold-italic variants are loaded!
fr_fr: Seul les variantes : normales, italiques, gras, gras-italique seront chargé !

source: Enlighter - Advanced javascript based syntax highlighting
pt_br: Enlighter - Syntax highlighter avançado feito em JavaScript

source: Enlighter related:
pt_br: Relacionado ao Enlighter:

source: EnlighterJS on GitHub
pt_br: EnlighterJS no GitHub

source: Enlighter on WordPress.org
pt_br: Enlighter no WordPress.org

source: Report a Bug
pt_br: Reportar um Bug

source: Theme Demo
pt_br: Demonstração do Tema

source: Environment Error
pt_br: Erro do Ambiente

source: Just insert an enlighter shortcode with the code to highlight into your posts/pages - That`s it!
pt_br: Apenas insira um shortcode do enlighter com o código que você deseja destacar no seu post/página - Só isso!

source: Language-Shortcodes
pt_br: Shortcodes-Linguagem

source: The most easy way to use Enlighter is to wrap your code, which should be highlighted, in a language-shortcode tag.
pt_br: A maneira mais fácil de utilizar o Enlighter é enolver o seu código, que deve ser destacado, em uma tag shortcode-linguagem.

source: Example
pt_br: Exemplo

source: Language-Shortcode List
pt_br: Lista de Shortcode-linguagem

source: Syntax
pt_br: Sintaxe

source: YOUR CODE
pt_br: SEU CÓDIGO

source: Attributes
pt_br: Atributos

source: (optional) - defines the theme that should used, will overwrite the settings-page values
pt_br: (opcional) - define o tema que deve ser utilizado, sobrescreverá os valores na página de configurações

source: (optional) - the group identifier if code-grouping is used (elements with matching identifiers will be grouped together)
pt_br: (opcional) - o identificador de grupo caso agrupamento de código esteja sendo utilizado (elementos com os mesmos identificadores serão agrupados)

source: Note: when using [codegroup] tags this attribute will be generated automaically - you don`t have to set it!
pt_br: Nota: quando utilizar tags [codegroup], este atributo será gerado automaticamente - você não precisa configurá-lo!

source: (optional) - set the name of the tab-pane, if not defined the language will be used as title
pt_br: (opcional) - configura o nome da aba do painel, se não definida, o título será a linguagem

source: (optional) - defines a set of lines which are pointed out (ranges are supported).
pt_br: (opcional) - define um conjunto de linhas que são destacadas (é possível escolher uma faixa de números).

source: e.g.
pt_br: ex

source: to highlight lines 1,2,3,4,20
pt_br: para destacar linhas 1,2,3,4,20

source: (optional) - set the line-numbering offset (starts at 1 by default)
pt_br: (opcional) - determina o número em que começa a numeração (o padrão é 1)

source: (optional) - show/hide linenumbers (true/false)
pt_br: (opcional) - mostrar/esconder número das linhas (true/false)

source: Codegroup-Shortcode
pt_br: Shortcode-Grupo

source: You can also use EnlighterJS to display a set of different codes within a tab-pane
pt_br: Voce também pode utilizar o EnlighterJS para mostrar um conjunto de códigos diferentes dentro de um panel com abas.

source: (optional) - set the name of the tab-pane, if not defined the language name will be used as title
pt_br: (opcional) - configura o nome do painel, se não definido a linguagem será utilizada com título

source: If you`re using other plugins which uses also language-shortcodes, you can use the enlighter with generic shortcode.
pt_br: Se você estiver utilizando outros plugins que também usam shortcodes de linguagem, você pode utilizar o enlighter com shortcode genérico.

source: (optional) - specify the language which should used, if not defined values from the settings-page are used
pt_br: (opcional) - especificar a linguagem que deve ser utilizada, se não definido, são utilizados os valores da página de configuração

source: View Help
pt_br: Visualizar Ajuda

source: Enlighter on GitHub
pt_br: Enlighter no GitHub

source: Default Theme
pt_br: Tema Padrão

source: Generic highlighting
pt_br: Highlight Genérico

source: Hide Linenumbers
pt_br: Esconder número das linhas

source: Default (use tabs)
pt_br: Padrão (usar abas)

source: Enabled
pt_br: Ativado

source: Disabled
pt_br: Desativado

source: Show
pt_br: Mostrar

source: Hide
pt_br: Esconder

source: The Enlighter-Plugin changes the priority of the filter by default to 12 - this means it will be applied <strong>after</strong> shortcodes are processed by WordPress. <strong>It may can influence other plugins.</strong>
pt_br: O Plugin-Enlighter muda a prioridade do filtro para 12, por padrão - isso significa que ele será aplicado <strong>depois</strong> que os shortcodes forem processados pelo WordPress. <strong>Pode pode influenciar em outros plugins.</strong>

source: Initialization Method
pt_br: Método de Inicialização

source: EnlighterJS needs to be "initialized" with a special metadata-tag or some startup-codes within a script-tag. Which method should be used ? (metadata based config will not pass the W3C Validator check)
pt_br: EnlighterJS precisa ser "inicializado" com uma tag especial de metadados ou alguns códigos de inicialização dentro de uma tag script. Qual método deve ser usado? (configuração baseada em metadados não vai passar na verificação do Validador W3C)

source: <strong>Default: </strong>Metadata based config
pt_br: <strong>Padrão: </strong>Configuração baseada em metadados

source: Metadata based config
pt_br: Configuração baseada em Metadados

source: Script based config
pt_br: Configuração baseada em Script

source: TinyMCE Integration (Visual Editor)
pt_br: Integração TinyMCE (Editor Visual)

source: Enlighter can directly integrated into the Visual-Editor by adding Preformatted styles for each supported language.
pt_br: Enlighter pode integrar-se ao Editor Visual adicionando estilos pré-formatados para cada linguagem suportada.

source: Enable Integration
pt_br: Habilitar Integração

source: It`s released under the terms of the MIT X11 License.
pt_br: É liberado sob os termos da licença MIT X11.

source: Includes:
pt_br: Inclui:

source: by
pt_br: por

source: License
pt_br: Licença

source: Slash-StyleComments
pt_br: Comentários estilo barra

source: Multiline-StyleComments
pt_br: Comentários multi-linha

source: StartDelimiter
pt_br: Delimitador de Início

source: StopDelimiter
pt_br: Delimitador de Fim
