Repository: xgxdmx/Kratos_Xiaoyou
Catalog: inc/enlighter/lang/enlighter-*.po
Languages: fr_fr, pt_br

source: Tutorials
fr_fr: Tutoriels

source: General Usage
fr_fr: Utilisation générale

source: Shortcodes
fr_fr: Code court

source: Shortcode-Options
fr_fr: Options des codes courts

source: Generic-Shortcode
fr_fr: Réglages des codes courts
pt_br: Shortcode-Genérico

source: External Themes
fr_fr: Thèmes externes

source: News & Updates
fr_fr: Nouvelles & Mises à jour

source: EnlighterJS Website
fr_fr: Site Web EnlighterJS

source: Settings
fr_fr: Réglages

source: About
fr_fr: À propos

source: view help
fr_fr: voir l’aide

source: Option <code>use_balanceTags</code> is enabled - this option is <strong>DEPRECATED</strong>. Might cause a weired behaviour by inserting random closing html tags into your code.
fr_fr: L'option <code>use_balanceTags</code> est activée ; cette option est <strong>DEPRECATED</strong>. Elle peut provoquer un comportement indésirable en insérant des balises HTML de fermeture aléatoire dans votre code.

source: Option <code>use_smilies</code> is enabled. Legacy smiley sequences like :) are replaced by images which also affects posted sourcecode.
fr_fr: L'option <code>use_smilies</code> est activée. Les séquences de smileys héritées telles que :) sont remplacées par des images, qui ont également une incidence sur le code source publié.

source: Plugin "Crayon Syntax Highlighter" is enabled - it may take over the Enlighter pre elements - highlighting will not work!
fr_fr: L'extension "Crayon Syntax Highlighter" est activé - elle peut prendre en charge les éléments Enlighter - la surbrillance ne fonctionnera pas!

source: Autoset Permissions failed - Please change the directory permission (chmod <code>0644</code> or <code>0777</code>) manually!
fr_fr: Erreur lors du changement automatique des permissions - Veuillez modifier manuellement les permissions du dossier (chmod <code>0644</code> or <code>0777</code>) !

source: The plugin is located within an invalid path - the <code>enlighter/</code> directory name is <strong>mandatory</strong>
fr_fr: L'extension est situé dans un chemin non valide - le nom du répertoire <code>enlighter/</code> est <strong>obligatoire</strong>.

source: Enlighter Codeblocks
fr_fr: Enlighter en bloc
pt_br: Blocos de Código Enlighter

source: Enlighter Inline
fr_fr: Enlighter en ligne

source: What&#8217;s New
fr_fr: Nouveautés

source: Appearance
fr_fr: Apparence
pt_br: Aparência

source: You can specify the default language and theme as well as the some output styles. If you want to customize themes, choose the default theme option "custom"
fr_fr: Vous pouvez spécifier la langue et le thème par défaut, ainsi que certains styles. Si vous souhaitez personnaliser les thèmes, choisissez l’option de thème par défaut « personnalisé ».
pt_br: Voceê pode especificar a linguagem padrão e o tema bem como alguns estilos de apresentação. Se quiser personalizar temas, escolha o tema padrão como "custom"

source: The indent-option will replace each tab at the beginning of a line with a selectable number of space-characters
fr_fr: L’option d’indentation remplacement chaque fabulation en début de ligne par un nombre sélectionnable de caractères espace
pt_br: A opção de indentação irá substituir cada aba no começo de uma linha com um número selecionável de caracteres de espaço

source: Global Settings
fr_fr: Réglages globaux

source: Theme
fr_fr: Thème

source: Default Language
fr_fr: Langage par défaut
pt_br: Linguagem Padrão

source: Code-Indent
fr_fr: Indentation
pt_br: Indentação de código

source: No modification (keep tabs)
fr_fr: Aucune modification (laisse les tabulations)

source: 1 Space
fr_fr: 1 espace
pt_br: 1 Espaço

source: Spaces
fr_fr: Espaces
pt_br: Espaços

source: Show Linenumbers
fr_fr: Voir les numéros de lignes
pt_br: Mostrar número das linhas

source: Mouseover on codelines
fr_fr: Mise en surbrillance lors du survol de la ligne
pt_br: Passar o mouse nas linhas de código

source: RawCode on dbclick
fr_fr: Affiche le code brut au double clic

source: Button Toolbar
fr_fr: Bouton de la barre d'outil

source: Enable/Disable specific toolbar buttons.
fr_fr: Activé/Désactivé des boutons spécifiques de la barre d’outils.

source: Raw-Codebutton
fr_fr: Bouton code source brut
pt_br: Codebutton-Original

source: Window-button (new Window)
fr_fr: Ouvre le code source dans une nouvelle fenêtre

source: Info-button
fr_fr: Bouton d’information

source: BETA Features
fr_fr: Fonctionnalités BETA

source: Warning: These options are for advanced users only and subjected to change!
fr_fr: Attention : ces options sont réservées aux utilisateurs avertis !

source: Dynamic Resource Invocation (DRI)
fr_fr: Invocation de Ressources Dynamiques - Dynamic Resource Invocation (DRI)

source: To optimize your website load-time it`s possible to load the EnlighterJS script dependencies only if they are required (requires script-position: footer).
fr_fr: Pour optimiser le temps de chargement de votre site Web, il est possible de charger les dépendances de script EnlighterJS uniquement si elles sont requises (requiert script-position: footer).

source: In case it`s enable, the plugin will observer it`s invocation (visual editor, shortcodes, markdown).
fr_fr: Dans le cas où il est activé, le plugin conservera son implémentation (éditeur visuel, codes abrégés, markdown).

source: Enable DRI
fr_fr: Activé la DRI

source: Compatibility Mode / 3rd Party Migration
fr_fr: Mode de compatibilité / Migration avec une tierce partie

source: Compatibility
fr_fr: Compatibilité

source: Do you use plugins which did not support Enlighter directly? In this case the compatibility mode converts the legacy code (desgined for other syntax highlighting plugins) into Enlighter codeblocks on the fly.
fr_fr: Si vous utilisez des plugins qui ne supportent pas directement Enlighter ; le mode de compatibilité convertit le code existant (conçu pour d'autres extension de coloration syntaxique) en blocs de code Enlighter à la volée.

source: This feature allows you to migrate to Enlighter without altering your old posts.
fr_fr: Cette fonctionnalité vous permet de migrer vers Enlighter sans modifier vos anciens messages.

source: Defaults
fr_fr: Défaut

source: Codeblocks with missing language identifier should highlighted as:
fr_fr: Les blocs de code dont l'identification de langue sont manquant doivent être mis en évidence comme suit :

source: Generic Code Blocks
fr_fr: Bloc de code génériques

source: Generic Highlighting
fr_fr: Surlignage générique

source: No Highlighting (RAW)
fr_fr: Pas de surlignage (RAW)

source: Filter Targets
fr_fr: Filtrer les cibles

source: Choose the content-sections to which the compatibility filter should be applied.
fr_fr: Choisissez les sections de contenu auxquelles le filtre de compatibilité doit être appliqué.

source: Enable the_content
fr_fr: Active the_content

source: Enable the_excerpt
fr_fr: Active the_excerpt

source: Enable comments
fr_fr: Active comments

source: Enable comments-excerpt
fr_fr: Active comments-excerpt

source: Enable widget-text
fr_fr: Active widget-text

source: Dynamic Content
fr_fr: Contenu dynamique

source: Support for "load more" buttons. It is required to highlight code sections which are dynamically added to your page via AJAX/XHR!
fr_fr: Prise en charge des boutons "load more". Il est nécessaire de mettre en évidence les sections de code qui sont ajoutées dynamiquement à votre page via AJAX/XHR !

source: If you use the <a href="https://jetpack.me/support/infinite-scroll/">InfiniteScroll Module</a>, enable this option to load the Enlighter.InfniteScroll extension. It is required to highlight code sections which are dynamically added to your page!
fr_fr: Si vous utilisez l'<a href="https://jetpack.me/support/infinite-scroll/">extension InfiniteScroll </a>, activez cette option pour charger l'extension Enlighter.InfniteScroll. Il est nécessaire de mettre à jour les sections de code qui sont ajoutées dynamiquement à votre page !

source: Infinite Scroll
fr_fr: Scroll infini

source: This options adds a trigger to the <code>ajaxComplete</code> event used by jQuery.
fr_fr: Cette option ajoute un déclencheur à l'événement <code>ajaxComplete</code> utilisé par jQuery.

source: Dynamic Ajax Content
fr_fr: Contenu Dynamique AJAX

source: bbPress Forums Plugin
fr_fr: Plugin de forum bbPress

source: These options are related to the popular <a href="https://wordpress.org/plugins/bbpress/" target="_blank">bbPress Forums Plugin</a>.
fr_fr: Ces options sont liées à la populaire<a href="https://wordpress.org/plugins/bbpress/" target="_blank"> extension de forum bbPress</a>.

source: <strong>Note: </strong> Backtick style code-elements of bbPress will be disabled when enabling one of the extensions to avoid conflicts!
fr_fr: <strong>Attention : </ strong> les éléments de code de style Backtick de bbPress sont désactivés lors de l'activation de l'une des extensions pour éviter les conflits !

source: Enable Shortcode support within bbPress topics and replies.
fr_fr: Active la prise en charge des codes courts dans les rubriques et les réponses de bbPress.

source: Enlighter Shortcodes
fr_fr: Codes courts Enlighter

source: Enable Markdown style fenced code blocks within bbPress topics and replies.
fr_fr: Active le marquage Markdown dans les rubriques et les réponses de bbPress.

source: Markdown Code-Blocks
fr_fr: Marquage Markdown

source: Cryptex E-Mail Obfuscation Plugin
fr_fr: Extension d'offuscation d'email Cryptex

source: These options are related to the <a href="https://wordpress.org/plugins/cryptex/" target="_blank">Cryptex E-Mail Address Obfuscation plugin</a>. It can protect E-Mail Addresses within your highlighted sourcecode.
fr_fr: Ces options sont relatives à <a href="https://wordpress.org/plugins/cryptex/" target="_blank">l'extension d'offuscation d'adresse e-mail Cryptex</a>. Il peut protéger les adresses e-mail au sein de votre code source mis en surbrillance.

source: Requires Cryptex 5.0 with enabled hyperlinks.
fr_fr: Requiert Cryptex 5.0 avec les liens hypertextes activés.

source: Enable Cryptex Support
fr_fr: Active le support de Cryptex

source: The default Email address which will be shown if the hyperlinks are disabled into the cryptex plugin
fr_fr: Adresse email par défaut qui sera affichée si les liens hypertextes sont désactivés dans le plugin cryptex

source: Fallback EMail Address
fr_fr: Adresse email de secours

source: can be any kind of text
fr_fr: peut être n'importe quel type de texte

source: Resources &amp; CDN (Content Delivery Network)
fr_fr: Ressources &amp; CDN (Content Delivery Network)

source: These options might be required when using a Content-Delivery-Network (CDN) or another server/location which outsources your CSS+Javascript files.
fr_fr: Ces options peuvent être nécessaires lors de l’utilisation d’un réseau CDN (Content-Delivery-Network) ou d’un autre serveur / emplacement externalisant vos fichiers CSS + Javascript.
pt_br: Essas opções podem ser exigidas quando utilizar um CDN ou outro servidor/localização que terceiriza os seus arquivos CSS e JavaScript.

source: In this case you have to manually include EnlighterJS.js, EnlighterJS.css and the MooTools Framework into your page!
fr_fr: Dans ce cas, vous devez inclure manuellement EnlighterJS.js, EnlighterJS.css et le framework MooTools dans votre page !
pt_br: Nesse caso, você deve incluir manualmente EnlighterJS.js, EnlighterJS.css e o Frameowkr MooTools na sua página!

source: Custom styles, generated with the ThemeCustomizer are
fr_fr: Les styles personnalisés générés avec ThemeCustomizer sont
pt_br: Estilos personalizados, gerados com o ThemeCustomizer estão

source: available here
fr_fr: disponible ici
pt_br: disponível aqui

source: Include Enlighter-CSS
fr_fr: Inclure Enlighter-CSS
pt_br: Incluir Enlighter-CSS

source: Include Enlighter-Javascript
fr_fr: Inclure Enlighter-Javascript
pt_br: Incluir Enlighter-Javascript

source: Custom/external themes located into your themes directory can be automatically loaded.
fr_fr: Les thèmes personnalisés / externes situés dans votre répertoire de thèmes peuvent être chargés automatiquement.

source: Include External Themes
fr_fr: Inclure les thèmes externe

source: MooTools Framework Source
fr_fr: Source du Framework Mootools
pt_br: Fonte do Framework MooTools

source: The required MooTools-Framework can be hosted by a public CDN provider or by your own.
fr_fr: Le Framework obligatoire MooTools peut être hébergé sur un CDN public ou chez vous.

source: Your WordPress Site
fr_fr: Votre site WordPress
pt_br: Seu Site WordPress

source: Google CDN
fr_fr: CDN Google

source: Not include
fr_fr: Ne pas inclure
pt_br: Não incluir

source: Initialization
fr_fr: Initialisation

source: Select the source/location of Enlighter`s initialization script.
fr_fr: Sélectionner la localisation script d’initialisation de Enlighter.

source: Enlighter Config
fr_fr: Configuration de Enlighter

source: Inline within header/footer
fr_fr: En-ligne dans header/footer

source: External File using <script src=""...>
fr_fr: Utilise un fichier externe <script src=« … »>

source: Javascript Position
fr_fr: Position du Javascript

source: Related Javascript files/inline scripts can be added to the footer (wp_footer) or header (wp_head).
fr_fr: Les fichiers Javascript peuvent être inclus dans le pied de page (wp_footer) ou l’en-tête (wp-head)

source: Header within wp_head
fr_fr: Dans l’en-tête avec la fonction wp_head

source: Footer within wp_footer
fr_fr: Dans le pied de page avec la fonction wp_head

source: CDN Location Info
fr_fr: Localisation du CDN

source: List of available CDN locations used by Enlighter.
fr_fr: Liste des CDN disponible utilisé par Enlighter.

source: Advanced Options
fr_fr: Options avancées
pt_br: Opções Avançadas

source: Warning: These options are for advanced users only!
fr_fr: Attention : options réservés aux utilisateurs avancés !
pt_br: Aviso: Essas opções são apenas para usuários avançados!

source: "WpAutoP" Filter Priority
fr_fr: Filtre de priorité "WpAutoP"
pt_br: Prioridade de Filtro "WpAutoP"

source: <strong>Deprecated:</strong> This feature will be removed in the future, because the new LowLevel Shortcode Handler will avoid wpautop rendering issues!
fr_fr: <strong>Deprecated :</strong> Cette fonctionnalité va être retiré dans une prochaine version !

source: The processing priority of the wpautop filter. Normally the filter will be applied before shortcode is handled and will maybe crash your code-appearance by adding linebreaks and p/br tags.
fr_fr: Normalement la priorité de traitement du filtre wpautop est appliqué avant que le code court ne soit traité et modifierait peut-être l'apparence de votre code en ajoutant des sauts de ligne et des balises p/br.
pt_br: O processamento de prioridade do filtro wpautop. Normalmente o filtro é aplicado antes dos shortcodes serem manipulados e pode quebrar a aparência do seu código ao adicionar quebras de linha com as tags p/br.

source: The Enlighter-Plugin <strong>does not</strong> change the priority of the filter by default.<strong>It may can influence other plugins.</strong>
fr_fr: Le plugin Enlighter <strong>ne</strong> modifie pas la priorité du filtre par défaut. <strong>Il peut y avoir une influence sur les autres plug-ins.</strong>

source: Filter-Priority
fr_fr: Priorité du filtre
pt_br: Prioridade-Filtro

source: Default (no changes)
fr_fr: Par défaut (aucun changement)
pt_br: Padrão (sem mudanças)

source: Priority 12 (after shortcode)
fr_fr: Priorité 12 (après les codes courts)
pt_br: Prioridade 12 (depois do shortcode)

source: CSS Selector
fr_fr: Sélecteur CSS
pt_br: Seletor CSS

source: The selectors are used to match all generated tags. Normally pre.EnlighterJSRAW/code.EnlighterJSRAW should be perfect (all tags which are generated by the plugin will be highlighted)
fr_fr: Les sélecteurs sont utilisés pour faire correspondre toutes les balises générées. Normalement pre.EnlighterJSRAW / code.EnlighterJSRAW devrait être parfait (toutes les balises générées par le plugin seront mises en surbrillance)
pt_br: Os seletores são usados para corresponder a todas as tags geradas. Normalmente pre.EnlighterJSRAW/code.EnlighterJSRAW deve ser funcionar perfeitamente (todas as tags geradas pelo plugin serão destacadas)

source: <strong>Default: </strong>pre.EnlighterJSRAW
fr_fr: <strong>Défaut : </strong>pre.EnlighterJSRAW
pt_br: <strong>Padrão: </strong>pre.EnlighterJSRAW

source: Block CSS Selector
fr_fr: Sélecteur CSS de bloc
pt_br: Selector de Bloco CSS

source: The CSS selector used to match generated block code
fr_fr: Le sélecteur CSS utilisé pour faire correspondre le style de bloc généré
pt_br: O seletor CSS utilizado para corresponder ao bloco de código gerado

source: <strong>Default: </strong>code.EnlighterJSRAW
fr_fr: <strong>Défaut : </strong>code.EnlighterJSRAW
pt_br: <strong>Padrão: </strong>code.EnlighterJSRAW

source: Inline CSS Selector
fr_fr: Sélecteur CSS en-ligne
pt_br: Seletor CSS inline

source: The CSS selector used to match generated inline code
fr_fr: Le sélecteur CSS utilisé pour faire correspondre le style en ligne généré
pt_br: O seletor CSS usado para corresponder ao código inline gerado

source: I18n (Internationalization)
fr_fr: I18n (Traduction)
pt_br: I18n (Internacionalização)

source: Should the plugin load language files (if available) to translate the settings page ?
fr_fr: Est ce que le plugin charge le fichier de traductions (si disponible) pour traduire les pages des réglages ?
pt_br: O plugin deve carregar arquivos de linguagem (se disponível) para traduzir a página de configurações?

source: Enable I18n
fr_fr: I18n activé
pt_br: Habilitar I18n

source: Enlighter Related
fr_fr: En rapport avec Enlighter

source: Got a problem ? Need support or want to request a new feature ?
fr_fr: Vous avez un problème ? Besoin de support ou d’une nouvelle fonctionnalité ?

source: Theme Customizer
fr_fr: Customisation du thème
pt_br: Personalizador de Temas

source: Visual Editor
fr_fr: Éditeur visuel

source: Text Editor
fr_fr: Éditeur de texte

source: Webfonts
fr_fr: Polices Web

source: Select the content you want to highlight and Enlighter takes care of the rest.
fr_fr: Sélectionnez le contenu que vous souhaitez mettre en surbrillance et Enlighter s’occupe du reste.

source: is developed by
fr_fr: est développé par
pt_br: é desenvolvido por

source: It`s released under the terms of the %s.
fr_fr: Distribué sous les termes de la licences %s.

source: MIT X11 License
fr_fr: Licence MIT X11

source: System Info
fr_fr: Informations systèmes

source: PHP Version:
fr_fr: Version de PHP :

source: PHP JSON Extension
fr_fr: Extension PHP JSON

source: available
fr_fr: disponible

source: not installed
fr_fr: non installé

source: Server Software:
fr_fr: Logiciel serveur :

source: Enlighter Plugin Version:
fr_fr: Version de l’extension Enlighter :

source: EnlighterJS Version:
fr_fr: Version EnlighterJS :

source: TinyMCE Extension:
fr_fr: Extension TinyMCE :

source: Gutenberg Extension:
fr_fr: Extension Gutenberg :

source: Cache writeable
fr_fr: Cache d’écriture

source: true
fr_fr: oui

source: false
fr_fr: non

source: Shortcode Processor
fr_fr: Processeur code court

source: disabled
fr_fr: désactivé

source: WordPress internal
fr_fr: WordPress interne

source: WordPress provides a build-in Shortcode-API to process shortcodes used by third-party plugins. This function may can cause issues when using it in Text-Editor-Mode with unescaped html characters - especially when posting source-code!
fr_fr: WordPress fournit une API Shortcode intégrée pour traiter les codes courts utilisés par les plugins tiers. Cette fonction peut entraîner des problèmes lors de son utilisation en mode éditeur de texte avec des caractères html non échappés, en particulier lors de la publication de code source !

source: To avoid such issues, Enlighter provides its own, fault tolerant, Shortcode processor (only affects Enlighter shortcodes!).
fr_fr: Pour éviter de tels problèmes, Enlighter fournit son propre processeur Shortcode tolérant aux pannes (n'affecte que les shortcodes Enlighter !).

source: If you do not need shortcodes (use the Visual-Editor-Integration instead) it is possible to disable the shortcode processing for performance reasons.
fr_fr: Si vous n'avez pas besoin de codes courts (utilisez plutôt l'intégration avec l'éditeur graphique), il est possible de désactiver le traitement du code court pour des raisons de performances.

source: <strong>Notice</strong>: the LowLevel Shortcode Processor is <strong>not invoked</strong> by the <a href="https://developer.wordpress.org/reference/functions/do_shortcode/">do_shortcode</a> function! If you need shortcode processing in other content section, you should consider to use the legacy version or add custom filters!
fr_fr: <strong>Remaruqe</strong> : le processeur de short code LowLevel n'est <strong>pas appelé</strong> par la fonction <a href="https://developer.wordpress.org/reference/functions/do_shortcode/">do_shortcode</a> ! Si vous avez besoin d'un traitement de code court dans une autre section de contenu, vous devriez envisager d'utiliser la version antérieure ou ajouter des filtres personnalisés !

source: Processor
fr_fr: Processeur

source: Legacy (WordPress based)
fr_fr: Légal (basé sur WordPress)

source: Disable Shortcodes
fr_fr: Désactiver les codes courts

source: Filter Targets - LowLevel Shortcode Processor
fr_fr: Cibles des filtres - Processeur LowLevel Shortcode

source: Choose the content-sections to which the shortcode processor should be applied.
fr_fr: Choisissez les sections de contenu auxquelles le processeur de code court doit être appliqué.

source: Language Shortcodes
fr_fr: Langage des codes courts
pt_br: Shortcodes de Linguagem

source: Do you want to use language shortcodes like [js] ? Disable it when your using other plugins which uses such shortcodes!
fr_fr: Voulez-vous utiliser des codes courts de langue comme [js]? Désactivez-le si vous utilisez d'autres plugins qui utilisent de tels codes courts !
pt_br: Você quer utilizar shortcodes de linguagem como [js]? Desative quando estiver usando outros plugins que utilizam esses shortcodes!

source: Enable Language Shortcodes
fr_fr: Active les codes courts
pt_br: Habilitar Shortcodes de Linguagem

source: Inline Syntax Highlighting
fr_fr: Mise en évidence de la syntaxe en ligne
pt_br: Syntax Highlighting Inline

source: Should shortcodes without linebreaks insinde handled as inline-code ?
fr_fr: Les codes courts sans sauts de ligne à l'intérieur doivent-ils être gérés en tant que code en ligne ?
pt_br: Os shortcodes sem quebra de linha interna devem ser tratados como código inline?

source: Enable Inline Syntax Highlighting
fr_fr: Active la surbrillance de la syntaxe en ligne
pt_br: Permitir Syntax Highlight Inline

source: Fenced Code Blocks
fr_fr: Blocs de code fermés

source: Markdown Fanatic ? Enlighter also supports <a href="https://help.github.com/articles/creating-and-highlighting-code-blocks/">GFM style</a> fenced code blocks. In case no language identifier is given, choose the default behaviour.
fr_fr: Fan de Markdown? Enlighter prend également en charge les <a href="https://help.github.com/articles/creating-and-highlighting-code-blocks/">styles GFM</a> bloqués. Si aucun identifiant de langue n'est fourni, choisissez le comportement par défaut.

source: Choose the content-sections to which the markdown processor should be applied.
fr_fr: Choisissez les sections de contenu auxquelles le processeur de marquage doit être appliqué.

source: Text/HTML Editor
fr_fr: Éditeur Texte/HTML
